// See https://aka.ms/new-console-template for more information
Console.WriteLine(" Hello, It's second exercise of homework !");
Console.WriteLine(" Напишите программу, которая на вход принимает число и выдаёт, является ли число чётным (делится ли оно на два без остатка).");
Console.WriteLine(" 4 -> да");
Console.WriteLine(" -3 -> нет");
Console.WriteLine(" 7 -> нет");

int a = 4;
int b = -3;
int c = 7;

if ((a%2) == 0)
{
     Console.WriteLine("YES");
} 
else 
{
    Console.WriteLine("NO");
}
if ((b%2) == 0)
{
     Console.WriteLine("YES");
} 
else 
{
    Console.WriteLine("NO");
}
if ((c%2) == 0)
{
     Console.WriteLine("YES");
} 
else 
{
    Console.WriteLine("NO");
}
 

